# Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой

a = "я чуть чуть задержалс на второй работе когда сходил на превую"
b = "чуть"
print(a.count(b))

# str1 = input()
# str2 = input()
# i = 0
# while  i < len(str1):
#   if str1[i:i + len(str2)] == str2:
#       count += 1
#       i += len(str2)
#   else:
#       i += 1
# print(count)